cfd/cases/leg_V3_closed/constant/dynamicMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}

dynamicFvMesh       dynamicOversetFvMesh;
dynamicOversetFvMeshCoeffs { }

solver          solidBody;
solidBodyCoeffs
{
    cellZone        c1;
    solidBodyMotionFunction tabulated6DoFMotion;
    tabulated6DoFMotionCoeffs
    {
        CofG            (0.028473 0.000000 -0.010847);
        timeDataFileName "<constant>/6DoF.dat";
    }
}
