cfd/cases/leg_V3_closed/0.orig/p
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}

dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 0;
boundaryField
{
    oversetPatch { type overset; }
    paddle { type zeroGradient; }
    inlet        { type zeroGradient; }
    outlet       { type fixedValue; value uniform 0; }
    "(sides|bottom|top)" { type zeroGradient; }
}
