cfd/cases/leg_V3_closed/0.orig/zoneID
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      zoneID;
}

dimensions      [0 0 0 0 0 0 0];
internalField   uniform 0;
boundaryField
{
    oversetPatch { type overset; value uniform 0; }
    ".*"         { type zeroGradient; }
}
