cfd/cases/leg_V3_closed/system/decomposeParDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      decomposeParDict;
}

// 重叠网格并行：scotch 在某些分区下会触发 "Attempt to cast type patch to type lduInterface"（v2606，closed 桨算例复现），
// 改用 hierarchical 规则分区，沙箱与实机均正常。
numberOfSubdomains 8;
method          hierarchical;
hierarchicalCoeffs { n (2 2 2); order xyz; }
